Revit 2024 API
ExtensibleStorageFilter Class
 A filter used to filter elements with extensible storage data based on specific Schema id.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class ExtensibleStorageFilter : ElementQuickFilter
Visual Basic
Public Class ExtensibleStorageFilter _
	Inherits ElementQuickFilter
Visual C++
public ref class ExtensibleStorageFilter : public ElementQuickFilter
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
See Also
ExtensibleStorageFilter Members
Autodesk.Revit.DB.ExtensibleStorage Namespace